package factory.simplefactory;
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼           BUG辟易

/**
 * 汽车简单工厂，根据客户端传过来的车名称创建对应的类，没有则返回null
 * author：Andy on 2019/6/12 0012-17:40
 * email:zsp872126510@gmail.com
 */
public class CarSimpleFactory {
    public static Car createCar(String carName) {
        switch (carName) {
            case "宝马":
                return new BMW();
            case "奥迪":
                return new Audi();
        }
        return null;
    }
}
